app/Http/Controllers/BookingController.php

    public function index()
    {
        return view('booking.index', [
            'title' => 'Booking',
            'booking' => Booking::with(['room', 'customers'])->orderBy('id', 'desc')->paginate(50)
---
SELECT * FROM `bookings` ORDER BY `id` DESC LIMIT 50 offset 0
SELECT * FROM `customers` WHERE `customers`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 11)
SELECT count(*) as aggregate FROM `bookings`

    public function create()
    {

        return view('booking.create', [
            'title' => 'Booking',
            'rooms' => RoomTypes::all(),
            'customers' => Customers::all()
        ]);
---
SELECT * FROM `bookings`
SELECT * FROM `room_types`
SELECT * FROM `customers`

    public function store(Request $request)
    {
        // return $request;

        $validatedData = $request->validate([
            'customers_id' => 'required',
            'room_id' => 'required',
            'numOfRoom' => 'required',
            'checkIn' => 'required',
            'checkOut' => 'required',
            'priceSum' => 'required',
            'note' => 'nullable'
        ]);

        Booking::create($validatedData);

        // Jika booking ditambahkan, kurangi value room_types.available dengan bookings.numOfRoom
        // Jika booking ditambahkan, tambahkan value room_types.total dengan bookings.numOfRoom
        $room = $request->room_id;
        $total = (int)request()->numOfRoom;
        $totalDb = RoomTypes::select('total')->value('total');
        $availDb = RoomTypes::select('available')->value('available');


        RoomTypes::where('id', $room)->update(['total' => $totalDb + $total ]);
        RoomTypes::where('id', $room)->update(['available' => $availDb - $total]);
---
INSERT INTO `bookings` (`customers_id`, `room_id`, `numOfRoom`, `checkIn`, `checkOut`, `priceSum`, `note`, `updated_at`, `created_at`) VALUES ('11', '5', '6', '2024-03-13', '2024-03-14', '450000', 'Tidak include Breakfast', '2024-03-04 20:59:13', '2024-03-04 20:59:13')
SELECT `total` FROM `room_types` LIMIT 1
SELECT `available` FROM `room_types` LIMIT 1
UPDATE `room_types` SET `total` = 2, `room_types`.`updated_at` = '2024-03-04 21:20:05' WHERE `id` = '1'
UPDATE `room_types` SET `available` = 98, `room_types`.`updated_at` = '2024-03-04 21:20:05' WHERE `id` = '1'