app/Http/Controllers/TestController.php

    public function index()
    {
        // Cara ke 1 untuk menentukan filter tanggal
        $date1 = new Carbon('first day of December 2023');
        $date2 = new Carbon('last day of December 2023');

        // Cara ke 2 untuk menentukan filter tanggal
        $date3 = Carbon::create(2023, 12, 1);
        $date4 = Carbon::create(2023, 12, 31);

        $query = Test::with('room')->orderBy('room_id')->get();

        // Query untuk menampilkan label dibawah chart
        $room = RoomTypes::orderBy('id')->get('name');

        // Query untuk menghitung data didalam database
        $value = Test::join('room_types', 'tests.room_id', '=', 'room_types.id')
                    ->select('room_types.id as id', 'room_types.name as name')
                    ->selectRaw('sum(tests.num) as num')
                    ->groupBy('room_types.id')
                    ->orderBy('room_types.id')
                    ->get();

        $kamar = RoomTypes::select('name', 'available', 'total')->get();

        $coba = Test::join('room_types', 'tests.room_id', '=', 'room_types.id')
                    ->select('room_types.id as id', 'room_types.name as name')
                    ->selectRaw('sum(tests.num) as num')
                    ->selectRaw('room_types.available - sum(tests.num) as avail')
                    ->groupBy('room_types.id')
                    ->orderBy('room_types.id')
                    ->get();
---
SELECT * FROM `tests` ORDER BY `room_id` ASC
SELECT `name` FROM `room_types` ORDER BY `id` ASC
SELECT `room_types`.`id` as `id`, `room_types`.`name` as `name`, count(tests.room_id) as count FROM `tests` inner join `room_types` on `tests`.`room_id` = `room_types`.`id` GROUP BY `room_types`.`id` ORDER BY `room_types`.`id` ASC
SELECT `name`, `available`, `total` FROM `room_types`
SELECT `room_types`.`id` as `id`, `room_types`.`name` as `name`, sum(tests.num) as num, room_types.available - num as avail FROM `room_types` inner join `tests` on `tests`.`room_id` = `room_types`.`id` GROUP BY `room_types`.`id` ORDER BY `room_types`.`id` ASC
SELECT `room_types`.`id` as `id`, `room_types`.`name` as `name`, sum(tests.num) as num, room_types.available - sum(tests.num) as avail FROM `tests` inner join `room_types` on `tests`.`room_id` = `room_types`.`id` GROUP BY `room_types`.`id` ORDER BY `room_types`.`id` ASC